ulbra_2022_2/programacao_web/AS/www/codeigniter4/app/Controllers/Admin/Client.php

SELECT *
FROM `clients`
---
    public function listClients(){
        $ClientModel = new ClientModel();
        $data = [
            'clients' => $ClientModel->findAll(),
        ];

SELECT *
FROM `contacts`
---
    public function listContacts(){
        $ContactModel = new ContactModel();
        $data = [
            'arrayClients'=>$ContactModel->findAll()
        ];

SELECT *
FROM `clients`
WHERE `clients`.`idClient` = '9'
---
    public function updateClient($idClient){
        $ClientModel = new ClientModel();
        $data = [
            'client' => $ClientModel->find($idClient),
        ];